{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of 'DEE stream' text addition to the header with Poppins font and gradient styling, linking to Header.tsx and multiple components with high confidence.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend component files, describing the DEE stream OTT platform's structure including header, hero, services, films, testimonials, contact sections, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark modes, including background, foreground, primary, secondary, and chart colors with border and shadow utilities.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'DEE stream' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component rendering the complete single-page layout with header, hero, about, services, featured films, filmmakers, testimonials, social media, contact sections, and footer on a white-to-blue gradient background.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying DEE stream's mission statement for OTT streaming platform with centered layout and gradient blue text accent on the brand name.",
  "frontend/src/components/ContactSection.tsx": "Contact section with email display and form (name, email, message fields) that validates input and opens mailto link to dee.streaming.cinema@gmail.com with toast notifications.",
  "frontend/src/components/FeaturedFilmsSection.tsx": "Featured Films section displaying a responsive grid of four film cards with poster images, titles, genres, hover animations, and gradient overlays revealing additional details.",
  "frontend/src/components/FilmmakersSection.tsx": "For Filmmakers section with distribution opportunity description and 'Submit via Email' button that opens mailto link to dee.streaming.cinema@gmail.com with film distribution inquiry subject.",
  "frontend/src/components/Footer.tsx": "Footer component with DEE stream logo, tagline, quick links navigation with smooth scroll, contact email, social media icons (Instagram, Facebook), copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed header component with scroll-based styling that displays the DEE stream logo and navigation menu with smooth scrolling to page sections.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image overlay, main headline, call-to-action buttons for watching content and submitting films via email.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout displaying five service offerings (digital premieres, independent films, regional cinema, web series, OTT platform) with icons and hover effects.",
  "frontend/src/components/SocialMediaSection.tsx": "Social media connection section with Instagram and Facebook icon links styled as gradient circular buttons.",
  "frontend/src/components/TestimonialsSection.tsx": "Three-column grid displaying filmmaker testimonials with quote icons, names, roles, and styled cards with hover effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors (blue gradient palette), Poppins font imports, and fade-in animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, Poppins font family, custom shadows, border radius variables, and animation keyframes for accordions and fade effects.",
  "project_state.json": "Project state tracking document for DEE stream OTT platform, defining architectural notes (white/blue gradient theme, Poppins fonts, mobile responsive), existing features (hero section, about, services, filmmaker section, social media), and schema version 7."
}